{
  "version": "1.1.0",
  "date": "2021/JUL/23",
  "author": "Josh Beveridge",
  "breaking": [
    {
      "changes": [
        "Alters the configuration file to use the word key over name for syntax consistency with other tools."
      ],
      "migrations": null,
      "attributes": null
    }
  ],
  "features": [
    {
      "changes": [
        "The init script now asks for a scripts folder alongside the markup folder because state management that happens in JavaScript needs to be considered when compiling the production files."
      ],
      "attributes": null
    },
    {
      "changes": [
        "Adds support for the width attribute, allowing the user to configure custom width values."
      ],
      "attributes": [
        "width"
      ]
    },
    {
      "changes": [
        "Adds support for state management through the use of \":x\" syntax, allowing for control over hover (:h), active (:a), focus (:f), and disabled (:d)."
      ],
      "attributes": null
    },
    {
      "changes": [
        "Adds support for normal and stretch prop values when defining a grid."
      ],
      "attributes": [
        "flex-grid"
      ]
    },
    {
      "changes": [
        "Adds support for the normal prop value."
      ],
      "attributes": [
        "align-items"
      ]
    }
  ],
  "optimizations": [
    {
      "changes": [
        "The init script will now fail if the directories entered in the prompt do not yet exist."
      ],
      "attributes": null
    },
    {
      "changes": [
        "Reworks a lot of the scripting into more centralized, reusable chunks."
      ],
      "attributes": null
    },
    {
      "changes": [
        "Removes the need for a Gulpfile for internal development and migrates to node execution of Gulp scripts."
      ],
      "attributes": null
    }
  ],
  "bugfixes": [
    {
      "changes": [
        "Ensures that that debug configuration properly applies to the compile script, as well as the build script."
      ],
      "attributes": null
    },
    {
      "changes": [
        "Updates the use of \"/\" characters in Sass math functions to resolve deprecation warnings."
      ],
      "attributes": null
    }
  ]
}