{
  "versions": [
    {
      "number": "1",
      "date": "2021/APR/25",
      "author": "Josh Beveridge",
      "changes": [
        {
          "themes": [
            "feature"
          ],
          "utilities": [],
          "notes": [
            "Adds a basic README file."
          ]
        },
        {
          "themes": [
            "bug"
          ],
          "utilities": [
            "margin",
            "padding"
          ],
          "notes": [
            "Adds specificity to margin and padding so that they override reset styles."
          ]
        },
        {
          "themes": [
            "feature"
          ],
          "utilities": [],
          "notes": [
            "Adds a handful of basic reset styles to ensure consistency."
          ]
        },
        {
          "themes": [
            "refactor"
          ],
          "utilities": [],
          "notes": [
            "Updates the build scripts so that output is more standardized."
          ]
        },
        {
          "themes": [
            "feature"
          ],
          "utilities": [
            "margin",
            "padding"
          ],
          "notes": [
            "Adds support for a whitespace configuration in the settings file."
          ]
        }
      ],
      "versions": [
        {
          "number": "2",
          "date": "2021/DEC/08",
          "author": "Josh Beveridge",
          "changes": [
            {
              "themes": [
                "breaking",
                "refactor"
              ],
              "utilities": [],
              "migrations": [
                "Make sure your query definitions in your config now include the full min-width query (e.g. if your query value was 900px, it now needs to be \"screen and (min-width 900px)\""
              ],
              "notes": [
                "Reworks the media queries configuration so that it now accepts full queries rather than numeric values.",
                "Adds a new intermediate default query, replacing the original s key, which is now xs."
              ]
            },
            {
              "themes": [
                "breaking",
                "refactor"
              ],
              "utilities": [
                "container"
              ],
              "migrations": [
                "If you'd like a container to retain 90% width on mobile devices, you can add a data-h2-width value of 90 to your configuration file and use that attribute."
              ],
              "notes": [
                "Containers no longer have a fixed width of 90% and will now span 100% of their parent until they reach their maximum width.",
                "This change was decided on because it's counterintuitive that a container doesn't span the full width of its parent, particularly when you have multiple containers inside of each other.",
                "The original fixed width of 90% was a convenience to avoid needing to add padding to containers on mobile devices, which isn't a good enough reason to prevent the expected behaviour."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [],
              "notes": [
                "Adds support for preference-based dark mode! If you have your browser set to a dark theme, Hydrogen now offers a :dark variant of all media queries that can also be combined with state (e.g. b:dark or b:dark:h).",
                "Class-based dark mode is in the works, but is more complicated to execute."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [],
              "notes": [
                "CSS variables can now be generated from Hydrogen's configuration file by enabling them under the variables object."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [],
              "notes": [
                "When developing Hydrogen, npm start now initializes the development watch script and opens the test page in the browser."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [
                "height"
              ],
              "notes": [
                "Height is now available as an attribute and can be set with custom configurations."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [
                "height",
                "width"
              ],
              "notes": [
                "Both the new height attribute and width attributes now automatically generate t-shirt size values based on the whitespace scale (e.g. you can now use data-h2-width='b(xl)' to access the xl value previously locked to margin and padding)."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [
                "bg-color",
                "overlay"
              ],
              "notes": [
                "Requires gradient configurations to now have a key for easier usage and deprecates the old syntax. Rather than typing the unique combination, you'll be able to use b(KEY).",
                "Gradient configuration syntax has been simplified so that color stops can now be an array of strings that contain each color value, rather than requiring a key and color value.",
                "This also modifies the way SCSS variables are exported, but will only affect gradients that use the new syntax to avoid breaking existing implementations.",
                "Colors and gradients are now checked for duplicates. The old syntax, while deprecated, will still work. If a gradient is using the same key as a color, the color will be prefered and a warning will be passed to the console."
              ]
            },
            {
              "themes": [
                "optimization"
              ],
              "utilities": [],
              "notes": [
                "Migrates to sass.sync() for the performance benefits."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "Hydrogen now throws a non-failing error when it finds that your input directories have no files in them."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "Most of the utility scripts have been simplified so that central handler scripts now handle environment detection and path generation."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "Hydrogen now prefers input/output configuration folders, rather than the now deprecated folders configuration. The h2-init script has been updated to reflect this change and will now also create the directories passed to it if they don't already exist."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "Console output has been slightly reformatted to make it clearer."
              ]
            }
          ],
          "versions": []
        },
        {
          "number": "1",
          "date": "2021/JUL/23",
          "author": "Josh Beveridge",
          "changes": [
            {
              "themes": [
                "breaking",
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "Alters the configuration file to use the word key over name for syntax consistency with other tools."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [],
              "notes": [
                "The init script now asks for a scripts folder alongside the markup folder because state management that happens in JavaScript needs to be considered when compiling the production files."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "The init script will now fail if the directories entered in the prompt do not yet exist."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "Reworks a lot of the scripting into more centralized, reusable chunks."
              ]
            },
            {
              "themes": [
                "refactor"
              ],
              "utilities": [],
              "notes": [
                "Removes the need for a Gulpfile for internal development and migrates to node execution of Gulp scripts."
              ]
            },
            {
              "themes": [
                "bug"
              ],
              "utilities": [],
              "notes": [
                "Ensures that that debug configuration properly applies to the compile script, as well as the build script."
              ]
            },
            {
              "themes": [
                "bug"
              ],
              "utilities": [],
              "notes": [
                "Updates the use of \"/\" characters in Sass math functions to resolve deprecation warnings."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [
                "width"
              ],
              "notes": [
                "Adds support for the width attribute, allowing the user to configure custom width values."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [],
              "notes": [
                "Adds support for state management through the use of \":x\" syntax, allowing for control over hover (:h), active (:a), focus (:f), and disabled (:d)."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [
                "flex-grid"
              ],
              "notes": [
                "Adds support for normal and stretch prop values when defining a grid."
              ]
            },
            {
              "themes": [
                "feature"
              ],
              "utilities": [
                "align-items"
              ],
              "notes": [
                "Adds support for the normal prop value."
              ]
            }
          ],
          "versions": [
            {
              "number": "16",
              "date": "2021/NOV/29",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [
                    "flex-item"
                  ],
                  "notes": [
                    "Fixes a bug where the content value didn't reset the flex value."
                  ]
                }
              ]
            },
            {
              "number": "15",
              "date": "2021/NOV/29",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [
                    "text-transform"
                  ],
                  "notes": [
                    "Adds support for the text-transform utility, allowing users to customize text to be capitalized, lowercase, or uppercase."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [
                    "flex-item"
                  ],
                  "notes": [
                    "Adds support for the auto and content values in the flex-item parameter. These values will allow flex grid items to grow to fill the remaining space or to assume the width of their contents respectively."
                  ]
                }
              ]
            },
            {
              "number": "14",
              "date": "2021/NOV/29",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [
                    "order"
                  ],
                  "notes": [
                    "Fixes a bug where Hydrogen wouldn't compile if the flex grid was disabled because it was still trying to process the order utility."
                  ]
                }
              ]
            },
            {
              "number": "13",
              "date": "2021/NOV/22",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Fixes a bug where the new utility generation script was appending defaults to the end of the configuration array, resulting in them being prioritized last."
                  ]
                },
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [
                    "bg-color",
                    "border",
                    "font-color",
                    "opacity",
                    "overlay",
                    "shadow",
                    "width"
                  ],
                  "notes": [
                    "Sets transition all for these properties rather than dedicated values because when used in concert, the last one would always take precendence."
                  ]
                },
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Fixes a bug that broke the production build script if the flex grid was disabled."
                  ]
                }
              ]
            },
            {
              "number": "12",
              "date": "2021/NOV/15",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "optimization"
                  ],
                  "utilities": [],
                  "notes": [
                    "When checking the user's markup, rather than compiling all files into a single text file that is then scraped, the clean script now processes each file independently."
                  ]
                },
                {
                  "themes": [
                    "optimization"
                  ],
                  "utilities": [],
                  "notes": [
                    "The clean script's scraping logic has been rewritten so that the CSS matching expression is now up to 40 times faster."
                  ]
                },
                {
                  "themes": [
                    "refactoring"
                  ],
                  "utilities": [
                    "border-weight",
                    "container",
                    "opacity",
                    "radius",
                    "shadow",
                    "width"
                  ],
                  "notes": [
                    "Basic utilities now share a centralized set of scripts, rather than each utility having its own."
                  ]
                },
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Duplicate keys for most configuration options are now handled by prioritizing the user's first definition using that key, including over legacy default values."
                  ]
                },
                {
                  "themes": [
                    "refactoring"
                  ],
                  "utilities": [],
                  "notes": [
                    "Begins preliminary work on deprecating the folders configuration in favor of simplified, more consistent input and output configurations."
                  ]
                },
                {
                  "themes": [
                    "style"
                  ],
                  "utilities": [
                    "bg-color",
                    "font-color",
                    "opacity",
                    "overlay"
                  ],
                  "notes": [
                    "Adds a transition so that state changes now ease from one value to another."
                  ]
                },
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [
                    "position",
                    "location"
                  ],
                  "notes": [
                    "Position's sticky value now comes with a default top value of 0 so that it works without the need for another attribute; this value can be overidden by location."
                  ]
                }
              ]
            },
            {
              "number": "11",
              "date": "2021/OCT/29",
              "author": "Peter Giles",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Switches to the synchronous version of fs.WriteFile to avoid failues when scripts execute slowly."
                  ]
                }
              ]
            },
            {
              "number": "10",
              "date": "2021/SEP/29",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Adds ignore values to the markup scraper so that Hydrogen doesn't scrape its own files, causing it to crash."
                  ]
                }
              ]
            },
            {
              "number": "9",
              "date": "2021/SEP/28",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Fixes a resulting bug from the previous version that caused the production version of the watch script to fail."
                  ]
                }
              ]
            },
            {
              "number": "8",
              "date": "2021/SEP/27",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [],
                  "notes": [
                    "Adds a new configuration option for exporting your settings as Sass variables where possible; this means you can now import things like your whitespace scale into Sass files outside of Hydrogen."
                  ]
                },
                {
                  "themes": [
                    "optimization"
                  ],
                  "utilities": [],
                  "notes": [
                    "Removes some legacy code and cleans up some dependencies in the script files."
                  ]
                },
                {
                  "themes": [
                    "optimization"
                  ],
                  "utilities": [],
                  "notes": [
                    "Adds Prettier support."
                  ]
                },
                {
                  "themes": [
                    "refactoring"
                  ],
                  "utilities": [],
                  "notes": [
                    "Updates the default set of variables to be more thoughtful and use standardized nomenclature."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [],
                  "notes": [
                    "Adds a default configuration in the color settings for transparent."
                  ]
                },
                {
                  "themes": [
                    "refactoring"
                  ],
                  "utilities": [],
                  "notes": [
                    "Renames the default theme colors to use agnostic language (e.g. purple => primary)."
                  ]
                },
                {
                  "themes": [
                    "refactoring"
                  ],
                  "utilities": [],
                  "notes": [
                    "Overhauls color variants so that they can be overidden with custom values or disabled entirely."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [
                    "margin"
                  ],
                  "notes": [
                    "Adds the ability to use negative whitespace values in the margin attribute."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [
                    "opacity"
                  ],
                  "notes": [
                    "Adds the opacity attribute so that you can now control an element's opacity."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [
                    "order"
                  ],
                  "notes": [
                    "Adds support for the order attribute when flex grids are enabled, allowing you to control the order of your grid items."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [
                    "overlay"
                  ],
                  "notes": [
                    "Adds support for the overlay attribute, allowing you to add an overlay to an element."
                  ]
                },
                {
                  "themes": [
                    "refactoring"
                  ],
                  "utilities": [
                    "radius"
                  ],
                  "notes": [
                    "Renames the default radius keys to be more descriptive."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [
                    "layer"
                  ],
                  "notes": [
                    "Adds support for the layer attribute, allowing you to create layers and apply them to elements, along with positioning."
                  ]
                }
              ]
            },
            {
              "number": "7",
              "date": "2021/SEP/09",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Fixes a typo (a missing $) that completely broke the overflow attribute."
                  ]
                }
              ]
            },
            {
              "number": "6",
              "date": "2021/SEP/08",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "dependencies"
                  ],
                  "utilities": [],
                  "notes": [
                    "Updates and fixes NPM warnings where possible, including to gulp-sass v5.0.0."
                  ]
                },
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "An improperly set environment variable had broken the init script."
                  ]
                }
              ]
            },
            {
              "number": "5",
              "date": "2021/AUG/06",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [],
                  "notes": [
                    "Enhances the clean script to accept key-value pairs when scanning markup and scripts."
                  ]
                }
              ]
            },
            {
              "number": "4",
              "date": "2021/AUG/06",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Updates the alpha Sass functions to use rgba over color.adjust, as it seems to have stoppped working."
                  ]
                }
              ]
            },
            {
              "number": "3",
              "date": "2021/AUG/06",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "refactor"
                  ],
                  "utilities": [
                    "bg-color",
                    "font-color"
                  ],
                  "notes": [
                    "Enhances color opacity so that the user can specify target opacities, rather than toggling the array on/off, offering more control and less bloat."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [],
                  "notes": [
                    "The clean script now warns the user if they try to use an opacity value that isn't defined in their configuration."
                  ]
                }
              ]
            },
            {
              "number": "2",
              "date": "2021/AUG/04",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "optimization"
                  ],
                  "utilities": [],
                  "notes": [
                    "Enhances the clean script such that it now searches individually compiled utility files rather than the library in its entirety on each call, speeding things up."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [],
                  "notes": [
                    "Adds a new watch script that will only rerun the build script if the user modifies the configuration file, otherwise it only performs the code match and CSS file construction."
                  ]
                },
                {
                  "themes": [
                    "refactor"
                  ],
                  "utilities": [],
                  "notes": [
                    "Reworks the compile script to meet the newly optimized requirements and adds compression to help alleviate large file implications."
                  ]
                },
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [],
                  "notes": [
                    "The init script now copies the default settings file over to the user's project to ensure that future updates don't break their configuration."
                  ]
                }
              ]
            },
            {
              "number": "1",
              "date": "2021/AUG/02",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Fixes an issue where the clean script wasn't properly accounting for CSS rules that required multiple selectors to work."
                  ]
                },
                {
                  "themes": [
                    "optimization"
                  ],
                  "utilities": [],
                  "notes": [
                    "The clean scripts now remove duplicate entries once the markup has been scraped to help reduce build time."
                  ]
                }
              ]
            }
          ]
        },
        {
          "number": "0",
          "date": "2021/APR/25",
          "author": "Josh Beveridge",
          "changes": [],
          "versions": [
            {
              "number": "7",
              "date": "2021/JUN/23",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "dependencies"
                  ],
                  "utilities": [],
                  "notes": [
                    "Updates dependencies to fix security warnings; certain dependencies are blocked and waiting on patches."
                  ]
                }
              ]
            },
            {
              "number": "6",
              "date": "2021/APR/26",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [],
                  "notes": [
                    "Fixes a color function bug that was causing the init script to fail."
                  ]
                },
                {
                  "themes": [
                    "refactor"
                  ],
                  "utilities": [],
                  "notes": [
                    "Enhances the init script so that the output it creates is more consistent."
                  ]
                }
              ]
            },
            {
              "number": "5",
              "date": "2021/APR/25",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "bug"
                  ],
                  "utilities": [
                    "display"
                  ],
                  "notes": [
                    "Fixes the display attribute not being properly escaped, causing quotations in the CSS."
                  ]
                }
              ]
            },
            {
              "number": "4",
              "date": "2021/APR/25",
              "author": "Josh Beveridge",
              "changes": [
                {
                  "themes": [
                    "feature"
                  ],
                  "utilities": [],
                  "notes": [
                    "Enhances the build scripts so that they provide helpful console output regarding processes as they run, the amount of time they take, and other descriptive messaging."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}