{
  "version": "2.0.0-beta.24",
  "date": "2022/AUG/22",
  "author": "Josh Beveridge",
  "beta": true,
  "en": {
    "breaking": [],
    "features": [
      {
        "changes": [
          "Adds a new :class[] modifier that allows you to target the element only if a class or classes have been applied to it.",
          "Classes are specified inside square brackets as a comma separated list and without a '.'",
          "This is particularly useful when styles need to change based on state - you can apply a class when the state changes and the styles will activate."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Adds a new :children[] modifier that allows you to target an elements children with styles.",
          "Children can be targeted using any valid CSS selector, including tags, classes, ids, and data attributes.",
          "This is helpful for bulk styling child elements and reduces a significant amount of markup bloat.",
          "The :children[] modifier can be overwritten by applying the same property to a child in the event you need a single (or multiple) children to deviate from the standard."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "The CSS variable file's contents is now included in hydrogen.css so that you no longer have to load a separate file.",
          "The option to generate a file still remains, but half the variables were being loaded by hydrogen.css already and it made more sense to avoid duplication of variables when loading both files by eliminating the need to load the variable file entirely if you were already loading Hydrogen."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Adds the ability to store your configuration file in the parent directory of the Node process to help support NPM workspaces."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Adds a new feedback link to the info object in the configuration file."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      }
    ],
    "optimizations": [
      {
        "changes": [
          "Optimizes the way certain properties override each other so that they only affect CSS values that they are intended to change."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Adds a new development README file in the lib directory that outlines the basic build flow."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      }
    ],
    "bugfixes": [
      {
        "changes": [
          "Fixes the broken settings link in the info object in the configuration file."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      }
    ]
  },
  "fr": {
    "breaking": [],
    "features": [
      {
        "changes": [
          "Ajoute un nouveau modificateur :class[] qui vous permet de cibler l'élément uniquement si une ou plusieurs classes lui ont été appliquées.",
          "Les classes sont spécifiées entre crochets, sous forme de liste séparée par des virgules et sans '.'",
          "Ceci est particulièrement utile lorsque les styles doivent changer en fonction de l'état - vous pouvez appliquer une classe lorsque l'état change et les styles seront activés."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Ajoute un nouveau modificateur :children[] qui vous permet de cibler les enfants d'un élément avec des styles.",
          "Les enfants peuvent être ciblés à l'aide de tout sélecteur CSS valide, y compris les balises, les classes, les ids et les attributs de données.",
          "Cela permet de styliser en vrac les éléments enfants et de réduire considérablement le nombre de balises.",
          "Le modificateur :children[] peut être remplacé par l'application de la même propriété à un enfant au cas où vous auriez besoin d'un seul (ou de plusieurs) enfant(s) pour déroger à la norme."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Le contenu du fichier variable CSS est désormais inclus dans le fichier hydrogen.css, de sorte que vous ne devez plus charger un fichier distinct.",
          "L'option permettant de générer un fichier demeure, mais la moitié des variables étaient déjà chargées par hydrogen.css et il était plus logique d'éviter la duplication des variables lors du chargement des deux fichiers en éliminant la nécessité de charger entièrement le fichier de variables si vous chargez déjà Hydrogen."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Ajoute la possibilité de stocker votre fichier de configuration dans le répertoire parent du processus Node pour aider à supporter les espaces de travail NPM."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Ajoute un nouveau lien de retour d'information à l'objet info dans le fichier de configuration."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      }
    ],
    "optimizations": [
      {
        "changes": [
          "Optimise la manière dont certaines propriétés se substituent les unes aux autres afin qu'elles n'affectent que les valeurs CSS qu'elles sont censées modifier."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      },
      {
        "changes": [
          "Ajoute un nouveau fichier README de développement dans le répertoire lib qui décrit le flux de construction de base."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      }
    ],
    "bugfixes": [
      {
        "changes": [
          "Corrige le lien brisé des paramètres dans l'objet info du fichier de configuration."
        ],
        "migrations": [],
        "attributes": [],
        "log": []
      }
    ]
  }
}